Repository: maximTestGit/english-sitkom-lab
Catalog: src/locales/*/messages.po
Languages: af, ar, de, es, fr, he, hr, ja, ru, tr, uk

source: (Click to reveal answer)
af: (Klik om antwoord te wys)
ar: (انقر للكشف عن الإجابة)
de: (Klicken, um die Antwort zu zeigen)
es: (Haz clic para revelar la respuesta)
fr: (Cliquez pour révéler la réponse)
he: (לחץ כדי לחשוף את התשובה)
hr: (Kliknite za otkrivanje odgovora)
ja: （クリックして答えを表示）
ru: (Нажмите, чтобы показать ответ)
tr: (Cevabı göstermek için tıklayın)
uk: (Натисніть, щоб показати відповідь)

source: {speed} of Normal Speed Player
af: {speed} van Normale Spoed Speler
ar: {speed} من السرعة العادية للمشغل
de: {speed} der normalen Wiedergabegeschwindigkeit
es: {speed} de la Velocidad Normal del Reproductor
fr: {speed} de la vitesse normale du lecteur
he: מנגן {speed} ממהירות נגן רגילה
hr: {speed} normalne brzine reprodukcije
ja: 通常速度の{speed}倍
ru: {speed} от Нормальной скорости плейера
tr: Normal Hızın {speed} katı
uk: {speed} від нормальної швидкості плеєра

source: {speed} of Normal Speed when you talk
af: {speed} van Normale Spoed wanneer jy praat
ar: {speed} من السرعة العادية عندما تتحدث
de: {speed} der normalen Geschwindigkeit wenn Sie sprechen
es: {speed} de la Velocidad Normal cuando hablas
fr: {speed} de la vitesse normale quand vous parlez
he: מנגן {speed} ממהירות רגילה כשאתה מדבר
hr: {speed} normalne brzine kada govorite
ja: 会話時の通常速度の{speed}倍
ru: {speed} от Нормальной скорости для Вашего текста
tr: Konuşurken Normal Hızın {speed} katı
uk: {speed} від нормальної швидкості для вашого тексту

source: <br>כתב: הֻכְתַּב (hukhtav) - "it was dictated"
af: <br>כתב: הֻכְתַּב (hukhtav) - "dit was gedikteer"
es: <br>כתב: הֻכְתַּב (hukhtav) - "fue dictado"
hr: <br>כתב: הֻכְתַּב (hukhtav) - "bilo je diktirano"
ru: <br>כתב: הֻכְתַּב (hukhtav) - "это было продиктовано"
uk: <br>כתב: הֻכְתַּב (hukhtav) - "це було продиктовано"

source: <br>כתב: הִכְתִּיב (hikhtiv) - "he dictated"
af: <br>כתב: הִכְתִּיב (hikhtiv) - "hy het gedikteer"
es: <br>כתב: הִכְתִּיב (hikhtiv) - "él dictó"
hr: <br>כתב: הִכְתִּיב (hikhtiv) - "diktirao je"
ru: <br>כתב: הִכְתִּיב (hikhtiv) - "он продиктовал"
uk: <br>כתב: הִכְתִּיב (hikhtiv) - "він продиктував"

source: <br>כתב: הִתְכַּתֵּב (hitkatev) - "he corresponded"
af: <br>כתב: הִתְכַּתֵּב (hitkatev) - "hy het gekorrespondeer"
es: <br>כתב: הִתְכַּתֵּב (hitkatev) - "él se correspondió"
hr: <br>כתב: הִתְכַּתֵּב (hitkatev) - "dopisivao se"
ru: <br>כתב: הִתְכַּתֵּב (hitkatev) - "он переписывался"
uk: <br>כתב: הִתְכַּתֵּב (hitkatev) - "він листувався"

source: <br>כתב: כָּתַב (katav) - "he wrote"
af: <br>כתב: כָּתַב (katav) - "hy het geskryf"
es: <br>כתב: כָּתַב (katav) - "él escribió"
hr: <br>כתב: כָּתַב (katav) - "pisao je"
ru: <br>כתב: כָּתַב (katav) - "он написал"
uk: <br>כתב: כָּתַב (katav) - "він написав"

source: <br>כתב: כִּתֵּב (kitev) - "he corresponded"
af: <br>כתב: כִּתֵּב (kitev) - "hy het gekorrespondeer"
es: <br>כתב: כִּתֵּב (kitev) - "él se correspondió"
hr: <br>כתב: כִּתֵּב (kitev) - "dopisivao se"
ru: <br>כתב: כִּתֵּב (kitev) - "он переписывался"
uk: <br>כתב: כִּתֵּב (kitev) - "він листувався"

source: <br>כתב: כֻּתַּב (kutav) - "it was written intensively"
af: <br>כתב: כֻּתַּב (kutav) - "dit was intensief geskryf"
es: <br>כתב: כֻּתַּב (kutav) - "fue escrito intensivamente"
hr: <br>כתב: כֻּתַּב (kutav) - "bilo je intenzivno napisano"
ru: <br>כתב: כֻּתַּב (kutav) - "это было интенсивно написано"
uk: <br>כתב: כֻּתַּב (kutav) - "це було інтенсивно написано"

source: <br>כתב: נִכְתַּב (nikhtav) - "it was written"
af: <br>כתב: נִכְתַּב (nikhtav) - "dit was geskryf"
es: <br>כתב: נִכְתַּב (nikhtav) - "fue escrito"
hr: <br>כתב: נִכְתַּב (nikhtav) - "bilo je napisano"
ru: <br>כתב: נִכְתַּב (nikhtav) - "это было написано"
uk: <br>כתב: נִכְתַּב (nikhtav) - "це було написано"

source: <br>להכתב: לְהִכָּתֵב (lehikatev) - "to be written"
af: <br>להכתב: לְהִכָּתֵב (lehikatev) - "om geskryf te word"
es: <br>להכתב: לְהִכָּתֵב (lehikatev) - "ser escrito"
hr: <br>להכתב: לְהִכָּתֵב (lehikatev) - "biti napisan"
ru: <br>להכתב: לְהִכָּתֵב (lehikatev) - "быть написанным"
uk: <br>להכתב: לְהִכָּתֵב (lehikatev) - "бути написаним"

source: <br>להכתיב: לְהֻכְתַּב (lehuktav) - "to be dictated"
af: <br>להכתיב: לְהֻכְתַּב (lehuktav) - "om gedikteer te word"
es: <br>להכתיב: לְהֻכְתַּב (lehuktav) - "ser dictado"
hr: <br>להכתיב: לְהֻכְתַּב (lehuktav) - "biti diktiran"
ru: <br>להכתיב: לְהֻכְתַּב (lehuktav) - "быть продиктованным"
uk: <br>להכתיב: לְהֻכְתַּב (lehuktav) - "бути продиктованим"

source: <br>להכתיב: לְהַכְתִּיב (lehaktiv) - "to dictate"
af: <br>להכתיב: לְהַכְתִּיב (lehaktiv) - "om te dikteer"
es: <br>להכתיב: לְהַכְתִּיב (lehaktiv) - "dictar"
hr: <br>להכתיב: לְהַכְתִּיב (lehaktiv) - "diktirati"
ru: <br>להכתיב: לְהַכְתִּיב (lehaktiv) - "диктовать"
uk: <br>להכתיב: לְהַכְתִּיב (lehaktiv) - "диктувати"

source: <br>להתכתב: לְהִתְכַּתֵּב (lehitkatev) - "to correspond"
af: <br>להתכתב: לְהִתְכַּתֵּב (lehitkatev) - "om te korrespondeer"
es: <br>להתכתב: לְהִתְכַּתֵּב (lehitkatev) - "corresponderse"
hr: <br>להתכתב: לְהִתְכַּתֵּב (lehitkatev) - "dopisivati se"
ru: <br>להתכתב: לְהִתְכַּתֵּב (lehitkatev) - "переписываться"
uk: <br>להתכתב: לְהִתְכַּתֵּב (lehitkatev) - "листуватися"

source: <br>לכתוב: לִכְתּוֹב (likhtov) - "to write"
af: <br>לכתוב: לִכְתּוֹב (likhtov) - "om te skryf"
es: <br>לכתוב: לִכְתּוֹב (likhtov) - "escribir"
hr: <br>לכתוב: לִכְתּוֹב (likhtov) - "pisati"
ru: <br>לכתוב: לִכְתּוֹב (likhtov) - "писать"
uk: <br>לכתוב: לִכְתּוֹב (likhtov) - "писати"

source: <br>לכתיב: לְכַתֵּב (lekatev) - "to correspond"
af: <br>לכתיב: לְכַתֵּב (lekatev) - "om te korrespondeer"
es: <br>לכתיב: לְכַתֵּב (lekatev) - "corresponderse"
hr: <br>לכתיב: לְכַתֵּב (lekatev) - "dopisivati se"
ru: <br>לכתיב: לְכַתֵּב (lekatev) - "переписываться"
uk: <br>לכתיב: לְכַתֵּב (lekatev) - "листуватися"

source: <br>לכתיב: לְכֻתַּב (lekutav) - "to be written intensively"
af: <br>לכתיב: לְכֻתַּב (lekutav) - "om intensief geskryf te word"
es: <br>לכתיב: לְכֻתַּב (lekutav) - "ser escrito intensivamente"
hr: <br>לכתיב: לְכֻתַּב (lekutav) - "biti intenzivno napisan"
ru: <br>לכתיב: לְכֻתַּב (lekutav) - "быть интенсивно написанным"
uk: <br>לכתיב: לְכֻתַּב (lekutav) - "бути інтенсивно написаним"

source: About
af: Oor
ar: حول
de: Über
es: Acerca de
fr: À propos
he: מידע
hr: O nama
ja: 概要
ru: Информация
tr: Hakkında
uk: Про програму

source: About the Application
af: Oor die Toepassing
ar: حول التطبيق
de: Über die Anwendung
es: Acerca de la Aplicación
fr: À propos de l'application
he: אודות היישום
hr: O aplikaciji
ja: アプリケーションについて
ru: О приложении
tr: Uygulama Hakkında
uk: Про додаток

source: Account
af: Rekening
ar: الحساب
de: Konto
es: Cuenta
fr: Compte
he: חשבון
hr: Račun
ja: アカウント
ru: Пользователь
tr: Hesap
uk: Користувач

source: Add custom Playlist
af: Voeg pasgemaakte Speellys by
ar: إضافة قائمة تشغيل مخصصة
de: Benutzerdefinierte Wiedergabeliste hinzufügen
es: Agregar Lista de Reproducción Personalizada
fr: Ajouter une playlist personnalisée
he: הוסף רשימת השמעה מותאמת אישית
hr: Dodati prilagođenu playlistu
ja: カスタムプレイリストを追加
ru: Добавить плейлист
tr: Özel Oynatma Listesi Ekle
uk: Додати плейлист

source: Add Flashcard
es: Agregar Tarjeta de Memoria
he: הוסף כרטיס זיכרון
hr: Dodaj karticu
ru: Добавить карточку
uk: Додати картку

source: Add New Card
es: Agregar Nueva Tarjeta
he: הוסף כרטיס חדש
hr: Dodaj novu karticu
ru: Добавить новую карточку
uk: Додати нову картку

source: Advanced
es: Avanzado
he: מתקדם
hr: Napredno
ru: Продвинутый
uk: Просунутий

source: AI-Generated Interactive Exercise (Experimental)
af: KI-gegenereerde Interaktiewe Oefening (Eksperimenteel)
ar: تمرين تفاعلي مولد بواسطة الذكاء الاصطناعي (تجريبي)
de: KI-generierte interaktive Übung (experimentell)
es: Ejercicio Interactivo Generado por IA (Experimental)
fr: Exercice interactif généré par IA (Expérimental)
he: תרגיל אינטראקטיבי שנוצר על ידי AI (ניסיוני)
hr: AI-generirana interaktivna vježba (eksperimentalno)
ja: AI生成のインタラクティブな練習（実験的）
ru: Интерактивное упражнение, созданное ИИ (экспериментальное)
tr: Yapay Zeka Tarafından Oluşturulan Etkileşimli Alıştırma (Deneysel)
uk: Інтерактивне вправа, створене ШІ (експериментальне)

source: Analysis
af: Analise
ar: تحليل
de: Analyse
es: Análisis
fr: Analyse
he: ניתוח
hr: Analiza
ja: 分析
ru: Анализ
tr: Analiz
uk: Аналіз

source: Answer
af: Antwoord
ar: الإجابة
de: Antwort
es: Respuesta
fr: Réponse
he: תשובה
hr: Odgovor
ja: 答え
ru: Ответ
tr: Cevap
uk: Відповідь

source: Back Side
es: Parte Trasera
he: צד אחורי
hr: Stražnja strana
ru: Обратная сторона
uk: Зворотний бік

source: Beginner
es: Principiante
he: מתחיל
hr: Početnik
ru: Начинающий
uk: Початківець

source: Binyan Characteristic
es: Característica de Binyan
he: מאפיין בניין
hr: Karakteristika Binyana
ru: Характеристика биньяна
uk: Характеристика Біньяну

source: Blure Youtube Captions
af: Vervaag Youtube Onderskrifte
ar: طمس ترجمات يوتيوب
de: YouTube-Untertitel ausblenden
es: Difuminar Subtítulos de Youtube
fr: Flouter les sous-titres Youtube
he: טשטש כתוביות יוטיוב
hr: Zamuti YouTube titlove
ja: YouTube字幕をぼかす
ru: Скрыть Youtube субтитры
tr: Youtube Altyazılarını Bulanıklaştır
uk: Приховати субтитри YouTube

source: Box:
af: Boks:
ar: صندوق:
es: Caja:
fr: Boîte :
he: תיבה:
hr: Kutija:
ja: ボックス:
ru: Коробка:
tr: Kutu:
uk: Коробка:

source: Camera
af: Kamera
ar: الكاميرا
de: Kamera
es: Cámara
fr: Caméra
he: מצלמה
hr: Kamera
ja: カメラ
ru: Камера
tr: Kamera
uk: Камера

source: Cancel
es: Cancelar
he: בטל
hr: Otkaži
ru: Отмена
uk: Скасувати

source: Captions for "{0}" uploaded successfully!
af: Onderskrifte vir "{0}" suksesvol opgelaai!
ar: تم تحميل ترجمات "{0}" بنجاح!
de: Untertitel für "{0}" erfolgreich hochgeladen!
es: ¡Subtítulos para "{0}" subidos con éxito!
fr: Les sous-titres pour "{0}" ont été téléversés avec succès!
he: כתוביות עבור "{0}" הועלו בהצלחה!
hr: Titlovi za "{0}" uspješno učitani!
ja: 「{0}」のキャプションが正常にアップロードされました！
ru: Субтитры для "{0}" успешно загружены!
tr: "{0}" için altyazılar başarıyla yüklendi!
uk: Субтитри для "{0}" успішно завантажені!

source: Card
af: Kaart
ar: بطاقة
de: Karte
es: Tarjeta
fr: Carte
he: כרטיס
hr: Kartica
ja: カード
ru: Карточка
tr: Kart
uk: Картка

source: Card {0} of {1}
af: Kaart {0} van {1}
ar: البطاقة {0} من {1}
de: Karte {0} von {1}
es: Tarjeta {0} de {1}
fr: Carte {0} de {1}
he: כרטיס {0} מתוך {1}
hr: Kartica {0} od {1}
ja: {1}枚中の{0}枚目のカード
ru: Карточка {0} из {1}
tr: {1} karttan {0} kart
uk: Картка {0} з {1}

source: Card Details:
af: Kaart Besonderhede:
ar: تفاصيل البطاقة:
de: Kartendetails:
es: Detalles de la Tarjeta:
fr: Détails de la carte :
he: פרטי הכרטיס:
hr: Detalji kartice:
ja: カードの詳細:
ru: Детали карточки:
tr: Kart Detayları:
uk: Деталі карти:

source: Check Answer
es: Verificar Respuesta
he: בדוק תשובה
hr: Provjeri odgovor
ru: Проверить ответ
uk: Перевірити відповідь

source: Clear Memory
af: Vee Geheue Skoon
ar: مسح الذاكرة
de: Speicher leeren
es: Limpiar Memoria
fr: Effacer la mémoire
he: נקה זיכרון
hr: Očisti memoriju
ja: メモリをクリア
ru: Очистить память
tr: Belleği Temizle
uk: Очистити пам'ять

source: Close
es: Cerrar
he: סגור
hr: Zatvori
ru: Закрыть
uk: Закрити

source: Collection:
af: Versameling:
ar: مجموعة
de: Sammlung:
es: Colección:
he: אוסף:
hr: Kolekcija:
ja: コレクション:
ru: Коллекция:
tr: Koleksiyon:
uk: Колекція:

source: Complexity
es: Complejidad
he: מורכבות
hr: Složenost
ru: Сложность
uk: Складність

source: Contact Me
af: Kontak My
ar: اتصل بي
de: Kontaktieren Sie mich
es: Contáctame
fr: Me contacter
he: צור קשר
hr: Kontaktirajte me
ja: お問い合わせ
ru: Связаться со мной
tr: İletişim
uk: Зв'язатися зі мною

source: Correct
af: Korrekte
ar: صحيح
de: Richtig
es: Correcto
he: נכון
hr: Točno
ja: 正解
ru: Правильно
tr: Doğru
uk: Правильно

source: Created:
af: Geskep:
ar: تم الإنشاء:
de: Erstellt:
es: Creado:
fr: Créé :
he: נוצר:
hr: Stvoreno:
ja: 作成日:
ru: Создано:
tr: Oluşturuldu:
uk: Створено:

source: Delete
af: Vee Uit
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
he: מחק
hr: Izbriši
ja: 削除
ru: Удалить
tr: Sil
uk: Видалити

source: Drils
af: Oefeninge
es: Ejercicios
he: תרגילים
hr: Vježbe
ru: Упражнения
uk: Вправи

source: Email
af: E-pos
es: Correo Electrónico
he: אימייל
hr: E-pošta
ru: Электронная почта
uk: Електронна пошта

source: Enter Root
es: Ingrese Raíz
he: הכנס שורש
hr: Unesite korijen
ru: Введите корень
uk: Введіть корінь

source: Enter your translation here...
es: Ingrese su traducción aquí...
he: הזן את התרגום שלך כאן...
hr: Unesite svoj prijevod ovdje...
ru: Введите ваш перевод здесь...
uk: Введіть свій переклад тут...

source: Entry "{textToProcess}" is added to your flashcard collection
af: Inskrywing "{textToProcess}" is by jou flitskaartversameling gevoeg
ar: تم إضافة "{textToProcess}" إلى مجموعة البطاقات التعليمية الخاصة بك
de: Eintrag "{textToProcess}" wurde zu Ihrer Karteikarten-Sammlung hinzugefügt
es: La entrada "{textToProcess}" se agregó a tu colección de tarjetas
fr: L'entrée "{textToProcess}" a été ajoutée à votre collection de cartes mémoire
he: הערך "{textToProcess}" נוסף לאוסף כרטיסי הזיכרון שלך
hr: Unos "{textToProcess}" je dodan u vašu kolekciju kartica
ja: 「{textToProcess}」がフラッシュカードコレクションに追加されました
ru: Элемент "{textToProcess}" добавлен в вашу коллекцию карточек
tr: "{textToProcess}" flash kart koleksiyonunuza eklendi
uk: Елемент "{textToProcess}" додано до вашої колекції карток

source: Error
af: Fout
ar: خطأ
de: Fehler
fr: Erreur
he: שגיאה
hr: Greška
ja: エラー
ru: Ошибка
tr: Hata
uk: Помилка

source: Error publishing exercise
af: Fout met publisering van oefening
ar: خطأ في نشر التمرين
de: Fehler beim Veröffentlichen der Übung
es: Error al publicar el ejercicio
fr: Erreur lors de la publication de l'exercice
he: שגיאה בפרסום התרגיל
hr: Greška pri objavljivanju vježbe
ja: エクササイズの公開エラー
ru: Ошибка публикации упражнения
tr: Alıştırma yayınlanırken hata oluştu
uk: Помилка публікації вправи

source: Error saving file.
af: Fout met stoor van lêer.
ar: خطأ في حفظ الملف.
de: Fehler beim Speichern der Datei.
es: Error al guardar el archivo.
fr: Erreur lors de l'enregistrement du fichier.
he: שגיאה בשמירת הקובץ.
hr: Greška pri spremanju datoteke.
ja: ファイルの保存エラー。
ru: Ошибка сохранения файла.
tr: Dosya kaydedilirken hata oluştu.
uk: Помилка збереження файлу.

source: Error uploading Captions for "{0}"!
af: Fout met oplaai van onderskrifte vir "{0}"!
ar: خطأ في تحميل ترجمات "{0}"!
de: Fehler beim Hochladen der Untertitel für "{0}"!
es: ¡Error al subir los subtítulos para "{0}"!
fr: Erreur lors du téléversement des sous-titres pour "{0}"!
he: שגיאה בהעלאת כתוביות עבור "{0}"!
hr: Greška pri učitavanju titlova za "{0}"!
ja: 「{0}」のキャプションのアップロードエラー！
ru: Ошибка загрузки субтитров для "{0}"!
tr: "{0}" için altyazılar yüklenirken hata oluştu!
uk: Помилка завантаження субтитрів для "{0}"!

source: Example
af: Voorbeeld
es: Ejemplo
he: דוגמה
hr: Primjer
ru: Пример
uk: Приклад

source: Exercise
af: Oefening
ar: تمرين
de: Übung
es: Ejercicio
fr: Exercice
he: תרגול
hr: Vježba
ja: 練習
ru: Упражнение
tr: Alıştırma
uk: Вправа

source: Export
es: Exportar
he: ייצא
hr: Izvoz
ru: Экспорт
uk: Експортувати

source: File
af: Lêer
ar: ملف
de: Datei
es: Archivo
fr: Fichier
he: קובץ
hr: Datoteka
ja: ファイル
ru: Файл
tr: Dosya
uk: Файл

source: File "{fileName}" saved successfully!
af: Lêer "{fileName}" suksesvol gestoor!
ar: تم حفظ الملف "{fileName}" بنجاح!
de: Datei "{fileName}" erfolgreich gespeichert!
es: Archivo "{fileName}" guardado con éxito!
fr: Le fichier "{fileName}" a été enregistré avec succès!
he: הקובץ "{fileName}" נשמר בהצלחה!
hr: Datoteka "{fileName}" uspješno spremljena!
ja: ファイル「{fileName}」が正常に保存されました！
ru: Файл "{fileName}" успешно сохранен!
tr: "{fileName}" dosyası başarıyla kaydedildi!
uk: Файл "{fileName}" успішно збережено!

source: Filter flashcards
es: Filtrar tarjetas de memoria
he: סנן כרטיסי זיכרון
hr: Filtriraj kartice
ru: Фильтровать карточки
uk: Фільтрувати картки

source: Flashcards
af: Flitskaarte
ar: البطاقات التعليمية
de: Karteikarten
es: Tarjetas de Memoria
fr: Cartes mémoire
he: כרטיסי זיכרון
hr: Kartice za učenje
ja: フラッシュカード
ru: Карточки
tr: Flash Kartlar
uk: Картки

source: Flashcards Collection
es: Colección de Tarjetas de Memoria
he: אוסף כרטיסי זיכרון
hr: Kolekcija kartica
ru: Коллекция карточек
uk: Колекція карток

source: Flashcards Exam
af: Flitskaarte Eksamen
ar: امتحان البطاقات التعليمية
de: Karteikartenprüfung
es: Examen de Tarjetas de Memoria
fr: Examen de cartes mémoire
he: מבחן כרטיסי זיכרון
hr: Ispit kartica za učenje
ja: フラッシュカード試験
ru: Экзамен по карточкам
tr: Flash Kart Sınavı
uk: Екзамен з карток

source: Front
es: Parte Delantera
he: צד קדמי
hr: Prednja strana
ru: Лицевая сторона
uk: Передній бік

source: Future
af: Toekomende Tyd
es: Futuro
he: עתיד
hr: Budućnost
ru: Будущее время
uk: Майбутній час

source: Generate Exercise
es: Generar Ejercicio
he: צור תרגיל
hr: Generiraj vježbu
ru: Создать упражнение
uk: Створити вправу

source: Hello
af: Hallo
ar: مرحباً
de: Hallo
es: Hola
fr: Bonjour
he: שלום
hr: Pozdrav
ja: こんにちは
ru: Привет,
tr: Merhaba
uk: Привіт,

source: Hello {name}
af: Hallo {name}
ar: مرحباً {name}
de: Hallo {name}
es: Hola {name}
fr: Bonjour {name}
he: שלום {name}
hr: Pozdrav {name}
ja: こんにちは {name}
ru: Привет, {name}
tr: Merhaba {name}
uk: Привіт, {name}

source: Hint
af: Wenk
es: Pista
he: רמז
hr: Savjet
ru: Подсказка
uk: Підказка

source: Home
af: Tuis
ar: الرئيسية
de: Startseite
es: Inicio
fr: Accueil
he: דף הבית
hr: Početna
ja: ホーム
ru: Главная
tr: Ana Sayfa
uk: Головна

source: Homework uploaded to the server successfully!
af: Huiswerk suksesvol na die bediener opgelaai!
ar: تم تحميل الواجب إلى الخادم بنجاح!
de: Hausaufgaben erfolgreich auf den Server hochgeladen!
es: Tarea subida al servidor con éxito!
fr: Les devoirs ont été téléversés sur le serveur avec succès!
he: שיעורי הבית הועלו לשרת בהצלחה!
hr: Zadaća uspješno učitana na server!
ja: 宿題がサーバーに正常にアップロードされました！
ru: Домашнее задание успешно загружено на сервер!
tr: Ödev başarıyla sunucuya yüklendi!
uk: Домашнє завдання успішно завантажено на сервер!

source: How To Register(Free)?
af: Hoe Om Te Registreer (Gratis)?
ar: كيفية التسجيل (مجاناً)؟
de: Wie registriere ich mich (kostenlos)?
es: ¿Cómo Registrarse (Gratis)?
fr: Comment s'inscrire (gratuit) ?
he: איך להירשם (חינם)?
hr: Kako se registrirati (besplatno)?
ja: 登録方法（無料）
ru: Как зарегистрироваться (бесплатно)?
tr: Nasıl Kayıt Olunur (Ücretsiz)?
uk: Як зареєструватися (безкоштовно)?

source: I Learn Language
af: Ek Leer Taal
es: Yo Aprendo Idioma
he: אני לומד שפה
hr: Učim jezik
ru: Я изучаю язык
uk: Я вивчаю мову

source: Incorrect
af: Verkeerde
ar: غير صحيح
de: Falsch
es: Incorrecto
he: לא נכון
hr: Netočno
ja: 不正解
ru: Неправильно
tr: Yanlış
uk: Неправильно

source: Intermediate
es: Intermedio
he: בינוני
hr: Srednje
ru: Средний
uk: Середній

source: Invalid Input:
af: Ongeldige Invoer:
es: Entrada inválida:
he: קלט לא חוקי:
hr: Neispravan unos:
ru: Неверный ввод:
uk: Неправильне введення:

source: Joke
es: Broma
he: בדיחה
hr: Šala
ru: Шутка
uk: Жарт

source: Kid
es: Niño
he: ילד
hr: Dijete
ru: Ребенок
uk: Дитина

source: Kids
es: Niños
he: ילדים
hr: Djeca
ru: Дети
uk: Діти

source: Last Reviewed:
af: Laas Hersien:
ar: آخر مراجعة:
de: Zuletzt geprüft:
es: Última Revisión:
fr: Dernière révision :
he: נבדק לאחרונה:
hr: Posljednji pregled:
ja: 最終レビュー:
ru: Последняя проверка:
tr: Son İnceleme:
uk: Останній огляд:

source: Login
af: Teken In
ar: تسجيل الدخول
de: Anmelden
es: Iniciar Sesión
fr: Connexion
he: התחבר
hr: Prijava
ja: ログイン
ru: Вход
tr: Giriş
uk: Увійти

source: Login {name} failed
af: Teken In {name} het misluk
ar: فشل تسجيل دخول {name}
de: Anmeldung für {name} fehlgeschlagen
es: Error al iniciar sesión de {name}
fr: Échec de connexion pour {name}
he: ההתחברות של {name} נכשלה
hr: Prijava za {name} nije uspjela
ja: {name}のログインに失敗しました
ru: Вход {name} не удался
tr: {name} girişi başarısız
uk: Вхід {name} не вдався

source: Logout
af: Teken Uit
ar: تسجيل الخروج
de: Abmelden
es: Cerrar Sesión
fr: Déconnexion
he: התנתק
hr: Odjava
ja: ログアウト
ru: Выход
tr: Çıkış
uk: Вийти

source: Logout {name} failed
af: Teken Uit {name} het misluk
ar: فشل تسجيل خروج {name}
de: Abmeldung für {name} fehlgeschlagen
es: Error al cerrar sesión de {name}
fr: Échec de déconnexion pour {name}
he: ההתנתקות של {name} נכשלה
hr: Odjava za {name} nije uspjela
ja: {name}のログアウトに失敗しました
ru: Выход {name} не удался
tr: {name} çıkışı başarısız
uk: Вихід {name} не вдався

source: Loop
af: Herhaal
ar: تكرار
de: Wiederholen
es: Repetir
fr: Boucle
he: לולאה
hr: Ponavljanje
ja: ループ
ru: Цикл
tr: Döngü
uk: Цикл

source: Loud Prompt when you talk
af: Luid Opskrif wanneer jy praat
ar: تنبيه صوتي مرتفع عندما تتحدث
de: Lauter Hinweis wenn Sie sprechen
es: Aviso Sonoro Fuerte cuando hablas
fr: Signal sonore fort quand vous parlez
he: הערה רועשת כשאתה מדבר
hr: Glasan zvučni signal kada vi govorite
ja: 会話時の大きな音声プロンプト
ru: Громкая подсказка Вашего текста
tr: Konuşurken Yüksek Sesli Uyarı
uk: Гучна підказка вашого тексту

source: Mute Player when you talk
af: Demper Speler wanneer jy praat
ar: كتم صوت المشغل عندما تتحدث
de: Player stumm schalten wenn Sie sprechen
es: Silenciar Reproductor cuando hablas
fr: Couper le son du lecteur quand vous parlez
he: השקט נגן כשאתה מדבר
hr: Utišaj player kada vi govorite
ja: 会話時にプレーヤーをミュート
ru: Выключить звук Вашего текста
tr: Konuşurken Oynatıcıyı Sustur
uk: Вимкнути звук вашого тексту

source: My Language
af: My Taal
es: Mi Idioma
he: השפה שלי
hr: Moj jezik
ru: Мой язык
uk: Моя мова

source: Navigate
af: Navigeer
ar: تصفح
de: Navigieren
es: Navegar
fr: Navigation
he: ניווט
hr: Navigacija
ja: ナビゲート
ru: Перейти
tr: Gezin
uk: Перейти

source: Next Review:
af: Volgende Hersiening:
ar: المراجعة التالية:
de: Nächste Prüfung:
es: Próxima Revisión:
fr: Prochaine révision :
he: הסקירה הבאה:
hr: Sljedeći pregled:
ja: 次のレビュー:
ru: Следующая проверка:
tr: Sonraki İnceleme:
uk: Наступний огляд:

source: No more cards...
af: Geen kaarte meer nie...
ar: لا توجد بطاقات أخرى...
de: Keine Karten mehr...
es: No hay más tarjetas...
fr: Plus de cartes...
he: אין עוד כרטיסים...
hr: Nema više kartica...
ja: これ以上カードはありません...
ru: Больше нет карточек...
tr: Daha fazla kart yok...
uk: Більше немає карток...

source: No text to analyze
af: Geen teks om te ontleed
ar: لا يوجد نص للتحليل
de: Kein Text zum Analysieren
es: No hay texto para analizar
fr: Aucun texte à analyser
he: אין טקסט לניתוח
hr: Nema teksta za analizu
ja: 分析するテキストがありません
ru: Нет текста для анализа
tr: Analiz edilecek metin yok
uk: Немає тексту для аналізу

source: No text to process
af: Geen teks om te verwerk nie
ar: لا يوجد نص للمعالجة
de: Kein Text zum Verarbeiten
es: No hay texto para procesar
fr: Aucun texte à traiter
he: אין טקסט לעיבוד
hr: Nema teksta za obradu
ja: 処理するテキストがありません
ru: Нет текста для обработки
tr: İşlenecek metin yok
uk: Немає тексту для обробки

source: No text to translate
af: Geen teks om te vertaal
ar: لا يوجد نص للترجمة
de: Kein Text zum Übersetzen
es: No hay texto para traducir
fr: Aucun texte à traduire
he: אין טקסט לתרגום
hr: Nema teksta za prevođenje
ja: 翻訳するテキストがありません
ru: Нет текста для перевода
tr: Çevrilecek metin yok
uk: Немає тексту для перекладу

source: Normal Speed Player
af: Normale Spoed Speler
ar: مشغل بالسرعة العادية
de: Player mit normaler Geschwindigkeit
es: Reproductor a Velocidad Normal
fr: Lecteur à vitesse normale
he: נגן במהירות רגילה
hr: Reprodukcija normalnom brzinom
ja: 通常速度プレーヤー
ru: Нормальная скорость плейера
tr: Normal Hız Oynatıcı
uk: Нормальна швидкість плеєра

source: Normal Speed when you talk
af: Normale Spoed wanneer jy praat
ar: السرعة العادية عندما تتحدث
de: Normale Geschwindigkeit wenn Sie sprechen
es: Velocidad Normal cuando hablas
fr: Vitesse normale quand vous parlez
he: מהירות רגילה כשאתה מדבר
hr: Normalna brzina kada vi govorite
ja: 会話時の通常速度
ru: Нормальная скорость для Вашего текста
tr: Konuşurken Normal Hız
uk: Нормальна швидкість для вашого тексту

source: Number of sentences
es: Número de oraciones
he: מספר המשפטים
hr: Broj rečenica
ru: Количество предложений
uk: Кількість речень

source: OK
ar: حسنًا
he: אישור
hr: U redu
ru: ОК
tr: Tamam
uk: ОК
