Repository: maximTestGit/english-sitkom-lab
Catalog: src/locales/*/messages.po
Languages: af, ar, de, es, fr, he, hr, ja, ru, tr, uk

source: Youglish
ar: يوجليش
he: יוגליש

source: Youtube
ar: يوتيوب
he: יוטיוב

source: YouTube
ar: يوتيوب
he: יוטיוב

source: {uiLanguage} subtitles have been loaded successfully.
ar: تم تحميل ترجمات {uiLanguage} بنجاح.
fr: Les sous-titres en {uiLanguage} ont été chargés avec succès.

source: Bye-bye {name}
ar: مع السلامة {name}
de: Auf Wiedersehen {name}
fr: Au revoir {name}
ja: さようなら {name}
tr: Hoşçakal {name}

source: How To?
ar: كيف؟
de: Wie geht das?
fr: Comment faire ?
ja: 使い方
tr: Nasıl Yapılır?

source: Operation Success
ar: نجاح العملية
fr: Opération réussie

source: Speech synthesis is not supported in this browser.
ar: توليف الكلام غير مدعوم في هذا المتصفح.
de: Sprachsynthese wird in diesem Browser nicht unterstützt.
fr: La synthèse vocale n'est pas prise en charge dans ce navigateur.
ja: このブラウザでは音声合成がサポートされていません。
tr: Konuşma sentezi bu tarayıcıda desteklenmiyor.

source: Success
ar: نجاح
fr: Succès

source: Upload .srt
ar: رفع ملف .srt
de: .srt hochladen
fr: Téléverser .srt
ja: .srtをアップロード
tr: .srt Yükle

source: Warning!
ar: تحذير!
fr: Attention !
