Repository: maximTestGit/english-sitkom-lab
Catalog: src/locales/*/messages.po
Languages: af, ar, de, es, fr, he, hr, ja, ru, tr, uk

source: Open .json
af: Maak .json oop
ar: فتح ملف .json
de: .json öffnen
es: Abrir .json
fr: Ouvrir .json
he: פתח .json
hr: Otvori .json
ja: .jsonを開く
ru: Открыть .json
tr: .json Aç
uk: Відкрити .json

source: Open .srt
af: Maak .srt oop
ar: فتح ملف .srt
de: .srt öffnen
es: Abrir .srt
fr: Ouvrir .srt
he: פתח .srt
hr: Otvori .srt
ja: .srtを開く
ru: Открыть .srt
tr: .srt Aç
uk: Відкрити .srt

source: Open custom video
af: Maak pasgemaakte video oop
ar: فتح فيديو مخصص
de: Benutzerdefiniertes Video öffnen
es: Abrir video personalizado
fr: Ouvrir une vidéo personnalisée
he: פתח וידאו מותאם אישית
hr: Otvori prilagođeni video
ja: カスタム動画を開く
ru: Открыть видео
tr: Özel Video Aç
uk: Відкрити відео

source: Open Exercise File
af: Maak Oefening Lêer oop
ar: فتح ملف التمرين
de: Übungsdatei öffnen
es: Abrir Archivo de Ejercicios
fr: Ouvrir un fichier d'exercice
he: פתח קובץ תרגול
hr: Otvori datoteku za vježbu
ja: 練習ファイルを開く
ru: Открыть файл упражнения
tr: Alıştırma Dosyası Aç
uk: Відкрити файл вправи

source: Open Settings
af: Maak Instellings oop
ar: فتح الإعدادات
de: Einstellungen öffnen
es: Abrir Configuración
fr: Ouvrir les paramètres
he: פתח הגדרות
hr: Otvori postavke
ja: 設定を開く
ru: Открыть настройки
tr: Ayarları Aç
uk: Відкрити налаштування

source: Open video on Youtube
af: Maak video op Youtube oop
ar: فتح الفيديو على يوتيوب
de: Video auf YouTube öffnen
es: Abrir video en Youtube
fr: Ouvrir la vidéo sur Youtube
he: פתח וידאו ביוטיוב
hr: Otvori video na YouTubeu
ja: YouTubeで動画を開く
ru: Открыть видео на Youtube
tr: Videoyu Youtube'da Aç
uk: Відкрити відео на YouTube

source: Operation completed successfully
af: Operasie suksesvol voltooi
es: Operación completada con éxito
he: הפעולה הושלמה בהצלחה
hr: Operacija uspješno dovršena
ru: Операция завершена успешно
uk: Операція завершена успішно

source: Origin Language:
af: Oorsprong Taal:
ar: اللغة الأصلية:
de: Ausgangssprache:
es: Idioma de Origen:
fr: Langue d'origine :
he: שפת מקור:
hr: Izvorni jezik:
ja: 原文の言語:
ru: Исходный язык:
tr: Orijinal Dil:
uk: Оригінальна мова:

source: Password
af: Wagwoord
es: Contraseña
he: סיסמה
hr: Lozinka
ru: Пароль
uk: Пароль

source: Past
af: Verlede Tyd
es: Pasado
he: עבר
hr: Prošlost
ru: Прошедшее время
uk: Минулий час

source: Philosophy
es: Filosofía
he: פילוסופיה
hr: Filozofija
ru: Философия
uk: Філософія

source: Please note that these subtitles are auto-generated and may contain semantic and contextual mistakes.
af: Neem asseblief kennis dat hierdie onderskrifte outomaties gegenereer is en semantiese en kontekstuele foute kan bevat.
es: Tenga en cuenta que estos subtítulos son generados automáticamente y pueden contener errores semánticos y contextuales.
he: שימו לב שכתוביות אלו נוצרו אוטומטית ועשויות להכיל טעויות סמנטיות והקשריות.
hr: Imajte na umu da su ovi titlovi automatski generirani i mogu sadržavati semantičke i kontekstualne pogreške.
ru: Обратите внимание, что эти субтитры создаются автоматически и могут содержать семантические и контекстные ошибки.
uk: Зверніть увагу, що ці субтитри створюються автоматично і можуть містити семантичні та контекстні помилки.

source: Please restart recording!
af: Begin asseblief weer met opname!
ar: يرجى إعادة بدء التسجيل!
de: Bitte Aufnahme neu starten!
es: Por favor, reinicie la grabación!
fr: Veuillez redémarrer l'enregistrement!
he: אנא הפעל מחדש את ההקלטה!
hr: Molimo ponovno pokrenite snimanje!
ja: 録音を再開してください！
ru: Пожалуйста, перезапустите запись!
tr: Lütfen kaydı yeniden başlatın!
uk: Будь ласка, перезапустіть запис!

source: Please select a root, binyan, and tense to proceed!
af: Kies asseblief 'n wortel, binyan, en tyd om voort te gaan!
es: ¡Por favor seleccione una raíz, binyan y tiempo para continuar!
he: אנא בחר שורש, בניין וזמן כדי להמשיך!
hr: Molimo odaberite korijen, binyan i vrijeme za nastavak!
ru: Пожалуйста, выберите корень, биньян и время, чтобы продолжить!
uk: Будь ласка, виберіть корінь, біньян і час, щоб продовжити!

source: Please wait
af: Wag asseblief
es: Por favor, espere
he: אנא המתן
hr: Molimo pričekajte
ru: Пожалуйста, подождите
uk: Будь ласка, зачекайте

source: Please, save your homework to the file and try again later. Contact the developer if the problem persists.
af: Stoor asseblief jou huiswerk na die lêer en probeer later weer. Kontak die ontwikkelaar indien die probleem voortduur.
ar: يرجى حفظ الواجب في الملف والمحاولة مرة أخرى لاحقًا. اتصل بالمطور إذا استمرت المشكلة.
de: Bitte speichern Sie Ihre Hausaufgaben in der Datei und versuchen Sie es später erneut. Wenden Sie sich an den Entwickler, wenn das Problem weiterhin besteht.
es: Por favor, guarde su tarea en el archivo e intente nuevamente más tarde. Contacte al desarrollador si el problema persiste.
fr: Veuillez enregistrer vos devoirs dans le fichier et réessayer plus tard. Contactez le développeur si le problème persiste.
he: אנא שמור את שיעורי הבית לקובץ ונסה שוב מאוחר יותר. צור קשר עם המפתח אם הבעיה נמשכת.
hr: Molimo spremite svoju zadaću u datoteku i pokušajte ponovno kasnije. Kontaktirajte programera ako problem potraje.
ja: 宿題をファイルに保存して、後でもう一度お試しください。問題が解決しない場合は、開発者に連絡してください。
ru: Пожалуйста, сохраните домашнее задание в файл и попробуйте позже. Свяжитесь с разработчиком, если проблема не исчезнет.
tr: Lütfen ödevinizi dosyaya kaydedin ve daha sonra tekrar deneyin. Sorun devam ederse geliştiriciyle iletişime geçin.
uk: Будь ласка, збережіть домашнє завдання у файл і спробуйте пізніше. Зв'яжіться з розробником, якщо проблема не зникне.

source: Present
af: Teenwoordige Tyd
es: Presente
he: הווה
hr: Sadašnjost
ru: Настоящее время
uk: Теперішній час

source: Prompt when you talk
af: Opskrif wanneer jy praat
ar: تنبيه عندما تتحدث
de: Hinweis wenn Sie sprechen
es: Aviso cuando hablas
fr: Signal quand vous parlez
he: הערה כשאתה מדבר
hr: Signal kada vi govorite
ja: 会話時のプロンプト
ru: Средняя громкость подсказки Вашего текста
tr: Konuşurken Uyarı
uk: Середня гучність підказки вашого тексту

source: Pronunciation
af: Uitspraak
ar: النطق
de: Aussprache
es: Pronunciación
fr: Prononciation
he: הגייה
hr: Izgovor
ja: 発音
ru: Произношение
tr: Telaffuz
uk: Вимова

source: Question
af: Vraag
ar: السؤال
de: Frage
es: Pregunta
he: שאלה
hr: Pitanje
ja: 質問
ru: Вопрос
tr: Soru
uk: Питання

source: Recording Synchronization Error
af: Opname Sinchronisasie Fout
ar: خطأ في تزامن التسجيل
de: Fehler bei der Aufnahmesynchronisation
es: Error de Sincronización de Grabación
fr: Erreur de synchronisation de l'enregistrement
he: שגיאת סנכרון הקלטה
hr: Greška sinkronizacije snimanja
ja: 録音同期エラー
ru: Ошибка синхронизации записи
tr: Kayıt Senkronizasyon Hatası
uk: Помилка синхронізації запису

source: Register
af: Registreer
ar: تسجيل
de: Registrieren
es: Registrarse
fr: S'inscrire
he: הירשם
hr: Registracija
ja: 登録
ru: Регистрация
tr: Kayıt Ol
uk: Реєстрація

source: Register {name} failed, try later
af: Registreer {name} het misluk, probeer later
ar: فشل تسجيل {name}، حاول لاحقاً
de: Registrierung für {name} fehlgeschlagen, versuchen Sie es später
es: Error al registrar a {name}, intenta más tarde
fr: Échec d'inscription pour {name}, réessayez plus tard
he: ההרשמה של {name} נכשלה, נסה מאוחר יותר
hr: Registracija za {name} nije uspjela, pokušajte kasnije
ja: {name}の登録に失敗しました。後でお試しください
ru: Регистрация {name} не удалась, попробуйте позже
tr: {name} kaydı başarısız, daha sonra deneyin
uk: Реєстрація {name} не вдалася, спробуйте пізніше

source: Reload Playlist
af: Herlaai Speellys
ar: إعادة تحميل قائمة التشغيل
de: Wiedergabeliste neu laden
es: Recargar Lista de Reproducción
fr: Recharger la playlist
he: טען מחדש את רשימת ההשמעה
hr: Ponovno učitaj playlistu
ja: プレイリストを再読み込み
ru: Перезагрузить плейлист
tr: Oynatma Listesini Yenile
uk: Перезавантажити плейлист

source: Restore
af: Herstel
ar: استعادة
de: Wiederherstellen
es: Restaurar
fr: Restaurer
he: שחזר
hr: Vrati
ja: 復元
ru: Восстановить
tr: Geri Yükle
uk: Відновити

source: Root/Binyan/Tense
af: Wortel/Binyan/Tyd
es: Raíz/Binyan/Tiempo
he: שורש/בניין/זמן
hr: Korijen/Binyan/Vrijeme
ru: Корень/Биньян/Время
uk: Корень/Біньян/Час

source: Root/Binyan/Tense Translation
es: Traducción de Raíz/Binyan/Tiempo
he: תרגום שורש/בניין/זמן
hr: Prijevod korijena/Binyana/vremena
ru: Перевод корня/биньяна/времени
uk: Переклад кореня/біньяну/часу

source: Save
af: Stoor
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
he: שמור
hr: Spremi
ja: 保存
ru: Сохранить
tr: Kaydet
uk: Зберегти

source: Save .srt
af: Stoor .srt
ar: حفظ ملف .srt
de: .srt speichern
es: Guardar .srt
fr: Enregistrer .srt
he: שמור .srt
hr: Spremi .srt
ja: .srtを保存
ru: Сохранить .srt
tr: .srt Kaydet
uk: Зберегти .srt

source: Select
af: Kies
ar: اختيار
de: Auswählen
es: Seleccionar
fr: Sélectionner
he: בחר
hr: Odaberi
ja: 選択
ru: Выделить
tr: Seç
uk: Виділити

source: Select Binyan
es: Seleccionar Binyan
he: בחר בניין
hr: Odaberite Binyan
ru: Выберите биньян
uk: Виберіть Біньян

source: Select Tense
af: Kies Tyd
es: Seleccionar Tiempo
he: בחר זמן
hr: Odaberite vrijeme
ru: Выберите время
uk: Виберіть час

source: Select text to process
af: Kies teks om te verwerk
ar: اختر النص للمعالجة
de: Text zum Verarbeiten auswählen
es: Selecciona texto para procesar
fr: Sélectionnez le texte à traiter
he: בחר טקסט לעיבוד
hr: Odaberite tekst za obradu
ja: 処理するテキストを選択してください
ru: Выделите текст для обработки
tr: İşlenecek metni seçin
uk: Виділіть текст для обробки

source: Settings
af: Instellings
es: Configuraciones
he: הגדרות
hr: Postavke
ru: Настройки
uk: Налаштування

source: Show
af: Wys
es: Mostrar
he: הצג
hr: Prikaži
ru: Показать
uk: Показати

source: Show Details
es: Mostrar Detalles
he: הצג פרטים
hr: Prikaži detalje
ru: Показать детали
uk: Показати деталі

source: Show No Captions
af: Wys Geen Onderskrifte
ar: عدم عرض الترجمات
de: Keine Untertitel anzeigen
es: No Mostrar Subtítulos
fr: Ne pas afficher les sous-titres
he: הצג ללא כתוביות
hr: Ne prikazuj titlove
ja: キャプションを表示しない
ru: Не показывать субтитры
tr: Altyazı Gösterme
uk: Не показувати субтитри

source: Show No Subtitles
af: Wys Geen Onderskrifte
es: No Mostrar Subtítulos
he: הצג ללא כתוביות
hr: Ne prikazuj titlove
ru: Не показывать субтитры
uk: Не показувати субтитри

source: Show Original Captions
af: Wys Oorspronklike Onderskrifte
ar: عرض الترجمات الأصلية
de: Originaluntertitel anzeigen
es: Mostrar Subtítulos Originales
fr: Afficher les sous-titres originaux
he: הצג כתוביות מקוריות
hr: Prikaži originalne titlove
ja: オリジナルのキャプションを表示
ru: Показать оригинальные субтитры
tr: Orijinal Altyazıları Göster
uk: Показати оригінальні субтитри

source: Show Original Subtitle + Next Line
af: Wys Oorspronklike Onderskrif + Volgende Reël
es: Mostrar Subtítulo Original + Siguiente Línea
he: הצג כתוביות מקוריות + השורה הבאה
hr: Prikaži originalni podnaslov + sljedeći redak
ru: Показать оригинальные субтитры + следующая строка
uk: Показати оригінальні субтитри + наступний рядок

source: Show Original Subtitles
af: Wys Oorspronklike Onderskrifte
es: Mostrar Subtítulos Originales
he: הצג כתוביות מקוריות
hr: Prikaži originalne podnaslove
ru: Показать оригинальные субтитры
uk: Показати оригінальні субтитри

source: Show Training Captions
af: Wys Oefen Onderskrifte
ar: عرض ترجمات التدريب
de: Trainingsuntertitel anzeigen
es: Mostrar Subtítulos de Entrenamiento
fr: Afficher les sous-titres d'entraînement
he: הצג כתוביות תרגול
hr: Prikaži titlove za vježbanje
ja: トレーニングキャプションを表示
ru: Показать учебные субтитры
tr: Eğitim Altyazılarını Göster
uk: Показати навчальні субтитри

source: Show Training Subtitles
af: Wys Oefen Onderskrifte
es: Mostrar Subtítulos de Entrenamiento
he: הצג כתוביות תרגול
hr: Prikaži podnaslove za vježbanje
ru: Показать учебные субтитры
uk: Показати навчальні субтитри

source: Show Translation
es: Mostrar Traducción
he: הצג תרגום
hr: Prikaži prijevod
ru: Показать перевод
uk: Показати переклад

source: Site language
es: Idioma del sitio
he: שפת האתר
hr: Jezik stranice
ru: Язык сайта
uk: Мова сайту

source: Slight Prompt when you talk
af: Klein Opskrif wanneer jy praat
ar: تنبيه خفيف عندما تتحدث
de: Leichter Hinweis wenn Sie sprechen
es: Aviso Suave cuando hablas
fr: Léger signal quand vous parlez
he: הערה קלה כשאתה מדבר
hr: Tihi signal kada vi govorite
ja: 会話時の小さな音声プロンプト
ru: Тихая подсказка Вашего текста
tr: Konuşurken Hafif Uyarı
uk: Тиха підказка вашого тексту

source: Sports
es: Deportes
he: ספורט
hr: Sport
ru: Спорт
uk: Спорт

source: Start (sec)
af: Begin (sek)
ar: البداية (ثانية)
de: Start (Sek.)
es: Inicio (seg)
fr: Début (sec)
he: התחלה (שניות)
hr: Početak (sek)
ja: 開始（秒）
ru: Начало (сек)
tr: Başlangıç (sn)
uk: Початок (сек)

source: Start Test
af: Begin Toets
ar: بدء الاختبار
de: Test starten
es: Iniciar Prueba
fr: Commencer le test
he: התחל מבחן
hr: Započni test
ja: テスト開始
ru: Начать тест
tr: Testi Başlat
uk: Почати тест

source: Style
es: Estilo
he: סגנון
hr: Stil
ru: Стиль
uk: Стиль

source: Subject
af: Onderwerp
es: Sujeto
he: נושא
hr: Predmet
ru: Местоимение
uk: Підмет

source: Text
af: Teks
ar: النص
es: Texto
fr: Texte
he: טקסט
hr: Tekst
ja: テキスト
ru: Текст
tr: Metin
uk: Текст

source: The Hif'il(הִפְעִיל) used to cause the action of the verb.
af: Die Hif'il(הִפְעִיל) word gebruik om die handeling van die werkwoord te veroorsaak.
es: El Hif'il(הִפְעִיל) se usa para causar la acción del verbo.
hr: Hif'il(הִפְעִיל) se koristi za uzrokovanje radnje glagola.
ru: Биньян Хиф'иль(הִפְעִיל) используется для обозначения причинного действия глагола.
uk: Біньян Хіф'іль(הִפְעִיל) використовується для позначення причинного дії дієслова.

source: The Hitpa'el(הִתְפַּעֵל) used for reflexive actions.
af: Die Hitpa'el(הִתְפַּעֵל) word gebruik vir refleksiewe handelinge.
es: El Hitpa'el(הִתְפַּעֵל) se usa para acciones reflexivas.
hr: Hitpa'el(הִתְפַּעֵל) se koristi za povratne radnje.
ru: Биньян Хитпа'эль(הִתְפַּעֵל) используется для возвратных действий.
uk: Біньян Хітпа'ель(הִתְפַּעֵל) використовується для позначення займенникових дій.

source: The Huf'al(הֻפְעַל) the passive form of Hif'il.
af: Die Huf'al(הֻפְעַל) is die passiewe vorm van Hif'il.
es: El Huf'al(הֻפְעַל) es la forma pasiva del Hif'il.
hr: Huf'al(הֻפְעַל) je pasivni oblik od Hif'il.
ru: Биньян Хуф'аль(הֻפְעַל) - пассивная форма биньяна Хиф'иль.
uk: Біньян Хуф'аль(הֻפְעַל) - пасивна форма біньяна Хіф'іль.

source: The Nif'al(נִפְעַל) used for passive voice of Pa'al or reflexive actions.
af: Die Nif'al(נִפְעַל) word gebruik vir die passiewe vorm van Pa'al of refleksiewe handelinge.
es: El Nif'al(נִפְעַל) se usa para la voz pasiva del Pa'al o acciones reflexivas.
hr: Nif'al(נִפְעַל) se koristi za pasivni oblik Pa'al-a ili povratne radnje.
ru: Биньян Ниф'аль(נִפְעַל) используется для пассивного залога биньяна Па'аль или возвратных действий.
uk: Біньян Ніф'аль(נִפְעַל) використовується для пасивного стану біньяна Па'аль або займенникових дій.

source: The Pa'al(פעל ,קַל) used for simple, active verbs.
af: Die Pa'al(פעל ,קַל) word gebruik vir eenvoudige, aktiewe werkwoorde.
es: El Pa'al(פעל ,קַל) se usa para verbos simples y activos.
hr: Pa'al(פעל ,קַל) se koristi za jednostavne, aktivne glagole.
ru: Биньян Па'аль(פעל ,קַל) используется для простых активных глаголов.
uk: Біньян Па'аль(פעל ,קַל) використовується для простих активних дієслів.

source: The Pi'el(פִּעֵל) used to intensify the meaning of the verb.
af: Die Pi'el(פִּעֵל) word gebruik om die betekenis van die werkwoord te intensifiseer.
es: El Pi'el(פִּעֵל) se usa para intensificar el significado del verbo.
hr: Pi'el(פִּעֵל) se koristi za pojačavanje značenja glagola.
ru: Биньян Пи'эль(פִּעֵל) используется для усиления значения глагола.
uk: Біньян Пі'ель(פִּעֵל) використовується для посилення значення дієслова.

source: The Pu'al(פֻּעַל) the passive form of Pi'el.
af: Die Pu'al(פֻּעַל) is die passiewe vorm van Pi'el.
es: El Pu'al(פֻּעַל) es la forma pasiva del Pi'el.
hr: Pu'al(פֻּעַל) je pasivni oblik od Pi'el.
ru: Биньян Пу'аль(פֻּעַל) - пассивная форма биньяна Пи'эль.
uk: Біньян Пу'аль(פֻּעַל) - пасивна форма біньяна Пі'ель.

source: They are provided solely as a reference tool for practicing speech.
af: Hulle word slegs as 'n verwysingsinstrument vir die oefening van spraak verskaf.
es: Se proporcionan únicamente como una herramienta de referencia para practicar el habla.
he: הן ניתנות אך ורק ככלי עזר לתרגול דיבור.
hr: Oni su pruženi isključivo kao referentni alat za vježbanje govora.
ru: Они предоставляются исключительно в качестве справочного инструмента для практики речи.
uk: Вони надаються виключно як довідковий інструмент для практики мовлення.

source: Tools
af: Gereedskap
ar: الأدوات
de: Werkzeuge
es: Herramientas
fr: Outils
he: כלים
hr: Alati
ja: ツール
ru: Инструменты
tr: Araçlar
uk: Інструменти

source: Training subtitles have been loaded successfully.
af: Oefen onderskrifte is suksesvol gelaai.
es: Los subtítulos de entrenamiento se han cargado correctamente.
he: כתוביות האימון נטענו בהצלחה.
hr: Titlovi za vježbanje su uspješno učitani.
ru: Учебные субтитры успешно загружены.
uk: Навчальні субтитри успішно завантажені.

source: Translate
es: Traducir
he: תרגם
hr: Prevedi
ru: Перевести
uk: Перекласти

source: Translation
af: Vertaling
ar: الترجمة
de: Übersetzung
es: Traducción
fr: Traduction
he: תרגום
hr: Prijevod
ja: 翻訳
ru: Перевод
tr: Çeviri
uk: Переклад

source: Translation Language:
af: Vertaling Taal:
ar: لغة الترجمة:
de: Zielsprache:
es: Idioma de Traducción:
fr: Langue de traduction :
he: שפת תרגום:
hr: Jezik prijevoda:
ja: 翻訳言語:
ru: Язык перевода:
tr: Çeviri Dili:
uk: Мова перекладу:

source: Translation:
af: Vertaling:
ar: الترجمة:
de: Übersetzung:
es: Traducción:
fr: Traduction :
he: תרגום:
hr: Prijevod:
ja: 翻訳:
ru: Перевод:
tr: Çeviri:
uk: Переклад:

source: Upload .srt to Server
af: Laai .srt na Bediener op
es: Subir .srt al Servidor
he: העלה .srt לשרת
hr: Učitaj .srt na poslužitelj
ru: Загрузить .srt на сервер
uk: Завантажити .srt на сервер

source: Username
af: Gebruikersnaam
es: Nombre de usuario
he: שם משתמש
hr: Korisničko ime
ru: Имя пользователя
uk: Ім'я користувача

source: Verb
af: Werkwoord
es: Verbo
he: פועל
hr: Glagol
ru: Глагол
uk: Дієслово

source: Verify Password
af: Bevestig Wagwoord
es: Verificar Contraseña
he: אמת סיסמה
hr: Potvrdi lozinku
ru: Подтвердите пароль
uk: Підтвердіть пароль

source: View Colection
af: Bekyk Versameling
ar: عرض المجموعة
de: Sammlung anzeigen
es: Ver Colección
fr: Voir la collection
he: הצג אוסף
hr: Pregledaj kolekciju
ja: コレクションを表示
ru: Просмотр коллекции
tr: Koleksiyonu Görüntüle
uk: Переглянути колекцію

source: Voice Hint
af: Stem Wenk
es: Pista de Voz
he: רמז קולי
hr: Glasovni savjet
ru: Голосовая подсказка
uk: Голосова підказка

source: Warning
af: Waarskuwing
ar: تحذير
de: Warnung
es: Advertencia
fr: Attention
he: אזהרה
hr: Upozorenje
ja: 警告
ru: Предупреждение
tr: Uyarı
uk: Попередження

source: You are not allowed to change Selection, when you have recorded exercise. Please clear recording first.(Click "Clear Record" button)
af: Jy mag nie die keuse verander wanneer jy 'n oefening opgeneem het nie. Vee asseblief eers die opname uit. (Klik op die "Vee Opname" knoppie)
ar: غير مسموح لك بتغيير التحديد عندما تكون قد سجلت تمرينًا. يرجى مسح التسجيل أولاً. (انقر على زر "مسح التسجيل")
de: Sie dürfen die Auswahl nicht ändern, wenn Sie eine Übung aufgezeichnet haben. Bitte löschen Sie zuerst die Aufnahme. (Klicken Sie auf die Schaltfläche "Aufnahme löschen")
es: No se le permite cambiar la selección cuando ha grabado un ejercicio. Por favor, borre la grabación primero. (Haga clic en el botón "Borrar Grabación")
fr: Vous n'êtes pas autorisé à changer la sélection lorsque vous avez enregistré un exercice. Veuillez d'abord effacer l'enregistrement. (Cliquez sur le bouton "Effacer l'enregistrement")
he: אינך רשאי לשנות את הבחירה כאשר יש לך תרגיל מוקלט. אנא נקה את ההקלטה תחילה. (לחץ על כפתור "נקה הקלטה")
hr: Nije vam dopušteno mijenjati odabir kada imate snimljenu vježbu. Molimo prvo očistite snimanje. (Kliknite gumb "Očisti snimanje")
ja: 録音されたエクササイズがある場合、選択を変更することはできません。まず録音をクリアしてください。（「録音をクリア」ボタンをクリック）
ru: Вы не можете изменить выбор, когда у вас есть записанное упражнение. Пожалуйста, сначала очистите запись. (Нажмите кнопку "Очистить запись")
tr: Kayıtlı alıştırmanız varken seçim yapmanıza izin verilmiyor. Lütfen önce kaydı temizleyin. ("Kaydı Temizle" düğmesine tıklayın)
uk: Ви не можете змінити вибір, коли у вас є записане вправа. Будь ласка, спочатку очистіть запис. (Натисніть кнопку "Очистити запис")

source: You have already recorded something. Please clear recording first.
af: Jy het reeds iets opgeneem. Vee asseblief eers die opname uit.
ar: لقد سجلت شيئًا بالفعل. يرجى مسح التسجيل أولاً.
de: Sie haben bereits etwas aufgenommen. Bitte löschen Sie zuerst die Aufnahme.
es: Ya ha grabado algo. Por favor, borre la grabación primero.
fr: Vous avez déjà enregistré quelque chose. Veuillez d'abord effacer l'enregistrement.
he: כבר הקלטת משהו. אנא נקה את ההקלטה תחילה.
hr: Već ste nešto snimili. Molimo prvo očistite snimanje.
ja: すでに何かを録音しています。まず録音をクリアしてください。
ru: Вы уже что-то записали. Пожалуйста, сначала очистите запись.
tr: Zaten bir şey kaydettiniz. Lütfen önce kaydı temizleyin.
uk: Ви вже щось записали. Будь ласка, спочатку очистіть запис.

source: You'll get an email letting you know when your video goes live on YouTube. It'll be set to "unlisted" so only the people you send the link to can watch it.
af: Jy sal 'n e-pos ontvang wat jou laat weet wanneer jou video op YouTube lewendig gaan. Dit sal op "ongelys" gestel word sodat slegs die mense aan wie jy die skakel stuur dit kan kyk.
ar: ستتلقى بريدًا إلكترونيًا لإعلامك عندما يصبح الفيديو الخاص بك مباشرًا على YouTube. سيتم تعيينه على "غير مدرج" بحيث يمكن فقط للأشخاص الذين ترسل لهم الرابط مشاهدته.
de: Sie erhalten eine E-Mail, die Sie darüber informiert, wenn Ihr Video auf YouTube live geht. Es wird auf "nicht gelistet" gesetzt, sodass nur die Personen, denen Sie den Link senden, es ansehen können.
es: Recibirá un correo electrónico informándole cuando su video esté en vivo en YouTube. Estará configurado como "no listado" para que solo las personas a las que envíe el enlace puedan verlo.
fr: Vous recevrez un email vous informant lorsque votre vidéo sera mise en ligne sur YouTube. Elle sera définie comme "non répertoriée" afin que seules les personnes à qui vous envoyez le lien puissent la regarder.
he: תקבל אימייל שמודיע לך כאשר הסרטון שלך יעלה ליוטיוב. הוא יוגדר כ"לא רשום" כך שרק האנשים שאתה שולח להם את הקישור יוכלו לצפות בו.
hr: Dobit ćete email koji će vas obavijestiti kada vaš video bude objavljen na YouTubeu. Bit će postavljen kao "nepopisan" tako da ga mogu gledati samo ljudi kojima pošaljete poveznicu.
ja: ビデオがYouTubeで公開されると、通知メールが届きます。それは「限定公開」に設定されるため、リンクを送信した人だけが視聴できます。
ru: Вы получите электронное письмо, когда ваше видео будет опубликовано на YouTube. Оно будет установлено как "не в списке", поэтому его смогут смотреть только те, кому вы отправите ссылку.
tr: Videonuz YouTube'da yayına girdiğinde size bir e-posta gönderilecek. "Liste dışı" olarak ayarlanacak, böylece yalnızca bağlantıyı gönderdiğiniz kişiler izleyebilecek.
uk: Ви отримаєте електронного листа, коли ваше відео буде опубліковано на YouTube. Воно буде встановлено як "не в списку", тому його зможуть дивитися лише ті, кому ви надішлете посилання.

source: Your Line
af: Jou Reël
ar: سطرك
de: Ihre Zeile
es: Tu Línea
fr: Votre ligne
he: השורה שלך
hr: Vaš redak
ja: あなたの行
ru: Ваш текст
tr: Senin Satırın
uk: Ваш текст

source: Your request is being processed...
af: Jou versoek word verwerk...
es: Su solicitud está siendo procesada...
he: הבקשה שלך בעיבוד...
hr: Vaš zahtjev se obrađuje...
ru: Ваш запрос обрабатывается...
uk: Ваш запит обробляється...

source: הופעל - Huf'al
ru: הופעל - Хуф'аль
uk: הופעל - Хуф'аль

source: הפעיל - Hif'il
ru: הפעיל - Хиф'иль
uk: הפעיל - Хіф'іль

source: התפעל - Hitpa'el
ru: התפעל - Хитпа'эль
uk: התפעל - Хітпа'ель

source: נפעל - Nif'al
uk: נפעל - Ніф'аль

source: פועל - Pu'al
uk: פועל - Пу'аль

source: פיעל - Pi'el
uk: פיעל - Пі'ель

source: פעל - Pa'al
uk: פעל - Па'аль
