
const binyanimExamples = [
    {
        root: 'כתב',
        binyanim: [
            {
                binyan: 'פעל',
                binyanCode: '0',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "כתבתי",
                            "nikud": "כָּתַבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "כתבת",
                            "nikud": "כָּתַבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "כתבת",
                            "nikud": "כָּתַבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "כתב",
                            "nikud": "כָּתַב"
                        },
                        {
                            "subject": "היא",
                            "verb": "כתבה",
                            "nikud": "כָּתְבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "כתבנו",
                            "nikud": "כָּתַבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "כתבתם",
                            "nikud": "כְּתַבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "כתבתן",
                            "nikud": "כְּתַבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "כתבו",
                            "nikud": "כָּתְבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "כותב",
                            "nikud": "כּוֹתֵב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "כותבת",
                            "nikud": "כּוֹתֶבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "כותבים",
                            "nikud": "כּוֹתְבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "כותבות",
                            "nikud": "כּוֹתְבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אכתוב",
                            "nikud": "אֶכְתֹּב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תכתוב",
                            "nikud": "תִּכְתֹּב"
                        },
                        {
                            "subject": "את",
                            "verb": "תכתבי",
                            "nikud": "תִּכְתְּבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יכתוב",
                            "nikud": "יִכְתֹּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תכתוב",
                            "nikud": "תִּכְתֹּב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נכתוב",
                            "nikud": "נִכְתֹּב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תכתבו",
                            "nikud": "תִּכְתְּבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תכתובנה",
                            "nikud": "תִּכְתֹּבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יכתבו",
                            "nikud": "יִכְתְּבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תכתובנה",
                            "nikud": "תִּכְתֹּבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'נפעל',
                binyanCode: '10',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "נכתבתי",
                            "nikud": "נִכְתַּבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "נכתבת",
                            "nikud": "נִכְתַּבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "נכתבת",
                            "nikud": "נִכְתַּבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "נכתב",
                            "nikud": "נִכְתַּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "נכתבה",
                            "nikud": "נִכְתְּבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נכתבנו",
                            "nikud": "נִכְתַּבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "נכתבתם",
                            "nikud": "נִכְתַּבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "נכתבתן",
                            "nikud": "נִכְתַּבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "נכתבו",
                            "nikud": "נִכְתְּבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "נכתב",
                            "nikud": "נִכְתָּב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "נכתבת",
                            "nikud": "נִכְתֶּבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "נכתבים",
                            "nikud": "נִכְתָּבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "נכתבות",
                            "nikud": "נִכְתָּבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "איכתב",
                            "nikud": "אֶכָּתֵב, אִכָּתֵב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תיכתב",
                            "nikud": "תִּכָּתֵב"
                        },
                        {
                            "subject": "את",
                            "verb": "תיכתבי",
                            "nikud": "תִּכָּתְבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "ייכתב",
                            "nikud": "יִכָּתֵב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תיכתב",
                            "nikud": "תִּכָּתֵב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "ניכתב",
                            "nikud": "נִכָּתֵב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תיכתבו",
                            "nikud": "תִּכָּתְבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תיכתבנה",
                            "nikud": "תִּכָּתֵבְנָה, תִּכָּתַבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "ייכתבו",
                            "nikud": "יִכָּתְבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תיכתבנה",
                            "nikud": "תִּכָּתֵבְנָה, תִּכָּתַבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'פועל',
                binyanCode: '20',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "כיתבתי",
                            "nikud": "כִּתַּבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "כיתבת",
                            "nikud": "כִּתַּבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "כיתבת",
                            "nikud": "כִּתַּבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "כיתב",
                            "nikud": "כִּתֵּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "כיתבה",
                            "nikud": "כִּתְּבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "כיתבנו",
                            "nikud": "כִּתַּבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "כיתבתם",
                            "nikud": "כִּתַּבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "כיתבתן",
                            "nikud": "כִּתַּבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "כיתבו",
                            "nikud": "כִּתְּבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מכתב",
                            "nikud": "מְכַתֵּב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מכתבת",
                            "nikud": "מְכַתֶּבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מכתבים",
                            "nikud": "מְכַתְּבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מכתבות",
                            "nikud": "מְכַתְּבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אכתב",
                            "nikud": "אֲכַתֵּב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תכתב",
                            "nikud": "תְּכַתֵּב"
                        },
                        {
                            "subject": "את",
                            "verb": "תכתבי",
                            "nikud": "תְּכַתְּבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יכתב",
                            "nikud": "יְכַתֵּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תכתב",
                            "nikud": "תְּכַתֵּב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נכתב",
                            "nikud": "נְכַתֵּב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תכתבו",
                            "nikud": "תְּכַתְּבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תכתבנה",
                            "nikud": "תְּכַתֵּבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יכתבו",
                            "nikud": "יְכַתְּבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תכתבנה",
                            "nikud": "תְּכַתֵּבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'פועל',
                binyanCode: '30',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "כותבתי",
                            "nikud": "כֻּתַּבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "כותבת",
                            "nikud": "כֻּתַּבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "כותבת",
                            "nikud": "כֻּתַּבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "כותב",
                            "nikud": "כֻּתַּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "כותבה",
                            "nikud": "כֻּתְּבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "כותבנו",
                            "nikud": "כֻּתַּבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "כותבתם",
                            "nikud": "כֻּתַּבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "כותבתן",
                            "nikud": "כֻּתַּבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "כותבו",
                            "nikud": "כֻּתְּבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מכותב",
                            "nikud": "מְכֻתָּב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מכותבת",
                            "nikud": "מְכֻתֶּבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מכותבים",
                            "nikud": "מְכֻתָּבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מכותבות",
                            "nikud": "מְכֻתָּבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אכותב",
                            "nikud": "אֲכֻתַּב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תכותב",
                            "nikud": "תְּכֻתַּב"
                        },
                        {
                            "subject": "את",
                            "verb": "תכותבי",
                            "nikud": "תְּכֻתְּבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יכותב",
                            "nikud": "יְכֻתַּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תכותב",
                            "nikud": "תְּכֻתַּב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נכותב",
                            "nikud": "נְכֻתַּב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תכותבו",
                            "nikud": "תְּכֻתְּבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תכותבנה",
                            "nikud": "תְּכֻתַּבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יכותבו",
                            "nikud": "יְכֻתְּבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תכותבנה",
                            "nikud": "תְּכֻתַּבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'הפעיל',
                binyanCode: '40',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "הכתבתי",
                            "nikud": "הִכְתַּבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "הכתבת",
                            "nikud": "הִכְתַּבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "הכתבת",
                            "nikud": "הִכְתַּבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "הכתיב",
                            "nikud": "הִכְתִּיב"
                        },
                        {
                            "subject": "היא",
                            "verb": "הכתיבה",
                            "nikud": "הִכְתִּיבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "הכתבנו",
                            "nikud": "הִכְתַּבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "הכתבתם",
                            "nikud": "הִכְתַּבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "הכתבתן",
                            "nikud": "הִכְתַּבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "הכתיבו",
                            "nikud": "הִכְתִּיבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מכתיב",
                            "nikud": "מַכְתִּיב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מכתיבה",
                            "nikud": "מַכְתִּיבָה"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מכתיבים",
                            "nikud": "מַכְתִּיבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מכתיבות",
                            "nikud": "מַכְתִּיבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אכתיב",
                            "nikud": "אַכְתִּיב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תכתיב",
                            "nikud": "תַּכְתִּיב"
                        },
                        {
                            "subject": "את",
                            "verb": "תכתיבי",
                            "nikud": "תַּכְתִּיבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יכתיב",
                            "nikud": "יַכְתִּיב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תכתיב",
                            "nikud": "תַּכְתִּיב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נכתיב",
                            "nikud": "נַכְתִּיב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תכתיבו",
                            "nikud": "תַּכְתִּיבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תכתבנה",
                            "nikud": "תַּכְתֵּבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יכתיבו",
                            "nikud": "יַכְתִּיבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תכתבנה",
                            "nikud": "תַּכְתֵּבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'הופעל',
                binyanCode: '50',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "הוכתבתי",
                            "nikud": "הֻכְתַּבְתִּי, הָָכְתַּבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "הוכתבת",
                            "nikud": "הֻכְתַּבְתָּ, הָָכְתַּבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "הוכתבת",
                            "nikud": "הֻכְתַּבְתְּ, הָָכְתַּבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "הוכתב",
                            "nikud": "הֻכְתַּב, הָָכְתַּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "הוכתבה",
                            "nikud": "הֻכְתְּבָה, הָָכְתְּבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "הוכתבנו",
                            "nikud": "הֻכְתַּבְנוּ, הָָכְתַּבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "הוכתבתם",
                            "nikud": "הֻכְתַּבְתֶּם, הָָכְתַּבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "הוכתבתן",
                            "nikud": "הֻכְתַּבְתֶּן, הָָכְתַּבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "הוכתבו",
                            "nikud": "הֻכְתְּבוּ, הָָכְתְּבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מוכתב",
                            "nikud": "מֻכְתָּב, מָָכְתָּב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מוכתבת",
                            "nikud": "מֻכְתֶּבֶת, מָָכְתֶּבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מוכתבים",
                            "nikud": "מֻכְתָּבִים, מָָכְתָּבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מוכתבות",
                            "nikud": "מֻכְתָּבוֹת, מָָכְתָּבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אוכתב",
                            "nikud": "אֻכְתַּב, אָָכְתַּב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תוכתב",
                            "nikud": "תֻּכְתַּב, תָָּכְתַּב"
                        },
                        {
                            "subject": "את",
                            "verb": "תוכתבי",
                            "nikud": "תֻּכְתְּבִי, תָָּכְתְּבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יוכתב",
                            "nikud": "יֻכְתַּב, יָָכְתַּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תוכתב",
                            "nikud": "תֻּכְתַּב, תָָּכְתַּב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נוכתב",
                            "nikud": "נֻכְתַּב, נָָכְתַּב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תוכתבו",
                            "nikud": "תֻּכְתְּבוּ, תָָּכְתְּבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תוכתבנה",
                            "nikud": "תֻּכְתַּבְנָה, תָָּכְתַּבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יוכתבו",
                            "nikud": "יֻכְתְּבוּ, יָָכְתְּבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תוכתבנה",
                            "nikud": "תֻּכְתַּבְנָה, תָָּכְתַּבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'התפעל',
                binyanCode: '60',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "התכתבתי",
                            "nikud": "הִתְכַּתַּבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "התכתבת",
                            "nikud": "הִתְכַּתַּבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "התכתבת",
                            "nikud": "הִתְכַּתַּבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "התכתב",
                            "nikud": "הִתְכַּתֵּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "התכתבה",
                            "nikud": "הִתְכַּתְּבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "התכתבנו",
                            "nikud": "הִתְכַּתַּבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "התכתבתם",
                            "nikud": "הִתְכַּתַּבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "התכתבתן",
                            "nikud": "הִתְכַּתַּבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "התכתבו",
                            "nikud": "הִתְכַּתְּבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מתכתב",
                            "nikud": "מִתְכַּתֵּב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מתכתבת",
                            "nikud": "מִתְכַּתֶּבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מתכתבים",
                            "nikud": "מִתְכַּתְּבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מתכתבות",
                            "nikud": "מִתְכַּתְּבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אתכתב",
                            "nikud": "אֶתְכַּתֵּב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תתכתב",
                            "nikud": "תִּתְכַּתֵּב"
                        },
                        {
                            "subject": "את",
                            "verb": "תתכתבי",
                            "nikud": "תִּתְכַּתְּבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יתכתב",
                            "nikud": "יִתְכַּתֵּב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תתכתב",
                            "nikud": "תִּתְכַּתֵּב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נתכתב",
                            "nikud": "נִתְכַּתֵּב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תתכתבו",
                            "nikud": "תִּתְכַּתְּבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תתכתבנה",
                            "nikud": "תִּתְכַּתֵּבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יתכתבו",
                            "nikud": "יִתְכַּתְּבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תתכתבנה",
                            "nikud": "תִּתְכַּתֵּבְנָה"
                        }
                    ]
                }
            },
        ]
    },
    {
        root: 'חשב',
        binyanim: [
            {
                binyan: 'פעל',
                binyanCode: '0',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "חשבתי",
                            "nikud": "חָשַׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "חשבת",
                            "nikud": "חָשַׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "חשבת",
                            "nikud": "חָשַׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "חשב",
                            "nikud": "חָשַׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "חשבה",
                            "nikud": "חָשְׁבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "חשבנו",
                            "nikud": "חָשַׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "חשבתם",
                            "nikud": "חֲשַׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "חשבתן",
                            "nikud": "חֲשַׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "חשבו",
                            "nikud": "חָשְׁבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "חושב",
                            "nikud": "חוֹשֵׁב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "חושבת",
                            "nikud": "חוֹשֶׁבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "חושבים",
                            "nikud": "חוֹשְׁבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "חושבות",
                            "nikud": "חוֹשְׁבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אחשוב",
                            "nikud": "אֶחְשֹׁב, אֶחֱשֹׁב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תחשוב",
                            "nikud": "תַּחְשֹׁב, תַּחֲשֹׁב"
                        },
                        {
                            "subject": "את",
                            "verb": "תחשבי",
                            "nikud": "תַּחְשְׁבִי, תַּחַשְׁבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יחשוב",
                            "nikud": "יַחְשֹׁב, יַחֲשֹׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תחשוב",
                            "nikud": "תַּחְשֹׁב, תַּחֲשֹׁב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נחשוב",
                            "nikud": "נַחְשֹׁב, נַחֲשֹׁב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תחשבו",
                            "nikud": "תַּחְשְׁבוּ, תַּחַשְׁבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תחשובנה",
                            "nikud": "תַּחְשֹׁבְנָה, תַּחֲשֹׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יחשבו",
                            "nikud": "יַחְשְׁבוּ, יַחַשְׁבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תחשובנה",
                            "nikud": "תַּחְשֹׁבְנָה, תַּחֲשֹׁבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'נפעל',
                binyanCode: '10',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "נחשבתי",
                            "nikud": "נֶחְשַׁבְתִּי, נֶחֱשַׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "נחשבת",
                            "nikud": "נֶחְשַׁבְתָּ, נֶחֱשַׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "נחשבת",
                            "nikud": "נֶחְשַׁבְתְּ, נֶחֱשַׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "נחשב",
                            "nikud": "נֶחְשַׁב, נֶחֱשַׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "נחשבה",
                            "nikud": "נֶחְשְׁבָה, נֶחֶשְׁבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נחשבנו",
                            "nikud": "נֶחְשַׁבְנוּ, נֶחֱשַׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "נחשבתם",
                            "nikud": "נֶחְשַׁבְתֶּם, נֶחֱשַׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "נחשבתן",
                            "nikud": "נֶחְשַׁבְתֶּן, נֶחֱשַׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "נחשבו",
                            "nikud": "נֶחְשְׁבוּ, נֶחֶשְׁבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "נחשב",
                            "nikud": "נֶחְשָׁב, נֶחֱשָׁב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "נחשבת",
                            "nikud": "נֶחְשֶׁבֶת, נֶחֱשֶׁבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "נחשבים",
                            "nikud": "נֶחְשָׁבִים, נֶחֱשָׁבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "נחשבות",
                            "nikud": "נֶחְשָׁבוֹת, נֶחֱשָׁבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "איחשב",
                            "nikud": "אֵחָשֵׁב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תיחשב",
                            "nikud": "תֵּחָשֵׁב"
                        },
                        {
                            "subject": "את",
                            "verb": "תיחשבי",
                            "nikud": "תֵּחָשְׁבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "ייחשב",
                            "nikud": "יֵחָשֵׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תיחשב",
                            "nikud": "תֵּחָשֵׁב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "ניחשב",
                            "nikud": "נֵחָשֵׁב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תיחשבו",
                            "nikud": "תֵּחָשְׁבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תיחשבנה",
                            "nikud": "תֵּחָשֵׁבְנָה, תֵּחָשַׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "ייחשבו",
                            "nikud": "יֵחָשְׁבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תיחשבנה",
                            "nikud": "תֵּחָשֵׁבְנָה, תֵּחָשַׁבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'פועל',
                binyanCode: '20',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "חישבתי",
                            "nikud": "חִשַּׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "חישבת",
                            "nikud": "חִשַּׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "חישבת",
                            "nikud": "חִשַּׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "חישב",
                            "nikud": "חִשֵּׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "חישבה",
                            "nikud": "חִשְּׁבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "חישבנו",
                            "nikud": "חִשַּׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "חישבתם",
                            "nikud": "חִשַּׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "חישבתן",
                            "nikud": "חִשַּׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "חישבו",
                            "nikud": "חִשְּׁבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מחשב",
                            "nikud": "מְחַשֵּׁב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מחשבת",
                            "nikud": "מְחַשֶּׁבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מחשבים",
                            "nikud": "מְחַשְּׁבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מחשבות",
                            "nikud": "מְחַשְּׁבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אחשב",
                            "nikud": "אֲחַשֵּׁב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תחשב",
                            "nikud": "תְּחַשֵּׁב"
                        },
                        {
                            "subject": "את",
                            "verb": "תחשבי",
                            "nikud": "תְּחַשְּׁבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יחשב",
                            "nikud": "יְחַשֵּׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תחשב",
                            "nikud": "תְּחַשֵּׁב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נחשב",
                            "nikud": "נְחַשֵּׁב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תחשבו",
                            "nikud": "תְּחַשְּׁבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תחשבנה",
                            "nikud": "תְּחַשֵּׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יחשבו",
                            "nikud": "יְחַשְּׁבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תחשבנה",
                            "nikud": "תְּחַשֵּׁבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'פועל',
                binyanCode: '30',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "חושבתי",
                            "nikud": "חֻשַּׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "חושבת",
                            "nikud": "חֻשַּׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "חושבת",
                            "nikud": "חֻשַּׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "חושב",
                            "nikud": "חֻשַּׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "חושבה",
                            "nikud": "חֻשְּׁבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "חושבנו",
                            "nikud": "חֻשַּׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "חושבתם",
                            "nikud": "חֻשַּׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "חושבתן",
                            "nikud": "חֻשַּׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "חושבו",
                            "nikud": "חֻשְּׁבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מחושב",
                            "nikud": "מְחֻשָּׁב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מחושבת",
                            "nikud": "מְחֻשֶּׁבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מחושבים",
                            "nikud": "מְחֻשָּׁבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מחושבות",
                            "nikud": "מְחֻשָּׁבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אחושב",
                            "nikud": "אֲחֻשַּׁב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תחושב",
                            "nikud": "תְּחֻשַּׁב"
                        },
                        {
                            "subject": "את",
                            "verb": "תחושבי",
                            "nikud": "תְּחֻשְּׁבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יחושב",
                            "nikud": "יְחֻשַּׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תחושב",
                            "nikud": "תְּחֻשַּׁב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נחושב",
                            "nikud": "נְחֻשַּׁב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תחושבו",
                            "nikud": "תְּחֻשְּׁבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תחושבנה",
                            "nikud": "תְּחֻשַּׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יחושבו",
                            "nikud": "יְחֻשְּׁבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תחושבנה",
                            "nikud": "תְּחֻשַּׁבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'הפעיל',
                binyanCode: '40',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "החשבתי",
                            "nikud": "הֶחְשַׁבְתִּי, הֶחֱשַׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "החשבת",
                            "nikud": "הֶחְשַׁבְתָּ, הֶחֱשַׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "החשבת",
                            "nikud": "הֶחְשַׁבְתְּ, הֶחֱשַׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "החשיב",
                            "nikud": "הֶחְשִׁיב, הֶחֱשִׁיב"
                        },
                        {
                            "subject": "היא",
                            "verb": "החשיבה",
                            "nikud": "הֶחְשִׁיבָה, הֶחֱשִׁיבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "החשבנו",
                            "nikud": "הֶחְשַׁבְנוּ, הֶחֱשַׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "החשבתם",
                            "nikud": "הֶחְשַׁבְתֶּם, הֶחֱשַׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "החשבתן",
                            "nikud": "הֶחְשַׁבְתֶּן, הֶחֱשַׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "החשיבו",
                            "nikud": "הֶחְשִׁיבוּ, הֶחֱשִׁיבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מחשיב",
                            "nikud": "מַחְשִׁיב, מַחֲשִׁיב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מחשיבה",
                            "nikud": "מַחְשִׁיבָה, מַחֲשִׁיבָה"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מחשיבים",
                            "nikud": "מַחְשִׁיבִים, מַחֲשִׁיבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מחשיבות",
                            "nikud": "מַחְשִׁיבוֹת, מַחֲשִׁיבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אחשיב",
                            "nikud": "אַחְשִׁיב, אַחֲשִׁיב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תחשיב",
                            "nikud": "תַּחְשִׁיב, תַּחֲשִׁיב"
                        },
                        {
                            "subject": "את",
                            "verb": "תחשיבי",
                            "nikud": "תַּחְשִׁיבִי, תַּחֲשִׁיבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יחשיב",
                            "nikud": "יַחְשִׁיב, יַחֲשִׁיב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תחשיב",
                            "nikud": "תַּחְשִׁיב, תַּחֲשִׁיב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נחשיב",
                            "nikud": "נַחְשִׁיב, נַחֲשִׁיב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תחשיבו",
                            "nikud": "תַּחְשִׁיבוּ, תַּחֲשִׁיבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תחשבנה",
                            "nikud": "תַּחְשֵׁבְנָה, תַּחֲשֵׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יחשיבו",
                            "nikud": "יַחְשִׁיבוּ, יַחֲשִׁיבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תחשבנה",
                            "nikud": "תַּחְשֵׁבְנָה, תַּחֲשֵׁבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'הופעל',
                binyanCode: '50',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "הוחשבתי",
                            "nikud": "הָָחְשַׁבְתִּי, הֻחְשַׁבְתִּי, הָָחֳשַׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "הוחשבת",
                            "nikud": "הָָחְשַׁבְתָּ, הֻחְשַׁבְתָּ, הָָחֳשַׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "הוחשבת",
                            "nikud": "הָָחְשַׁבְתְּ, הֻחְשַׁבְתְּ, הָָחֳשַׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "הוחשב",
                            "nikud": "הָָחְשַׁב, הֻחְשַׁב, הָָחֳשַׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "הוחשבה",
                            "nikud": "הָָחְשְׁבָה, הֻחְשְׁבָה, הָָחָָשְׁבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "הוחשבנו",
                            "nikud": "הָָחְשַׁבְנוּ, הֻחְשַׁבְנוּ, הָָחֳשַׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "הוחשבתם",
                            "nikud": "הָָחְשַׁבְתֶּם, הֻחְשַׁבְתֶּם, הָָחֳשַׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "הוחשבתן",
                            "nikud": "הָָחְשַׁבְתֶּן, הֻחְשַׁבְתֶּן, הָָחֳשַׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "הוחשבו",
                            "nikud": "הָָחְשְׁבוּ, הֻחְשְׁבוּ, הָָחָָשְׁבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מוחשב",
                            "nikud": "מָָחְשָׁב, מֻחְשָׁב, מָָחֳשָׁב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מוחשבת",
                            "nikud": "מָָחְשֶׁבֶת, מֻחְשֶׁבֶת, מָָחֳשֶׁבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מוחשבים",
                            "nikud": "מָָחְשָׁבִים, מֻחְשָׁבִים, מָָחֳשָׁבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מוחשבות",
                            "nikud": "מָָחְשָׁבוֹת, מֻחְשָׁבוֹת, מָָחֳשָׁבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אוחשב",
                            "nikud": "אָָחְשַׁב, אֻחְשַׁב, אָָחֳשַׁב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תוחשב",
                            "nikud": "תָָּחְשַׁב, תֻּחְשַׁב, תָָּחֳשַׁב"
                        },
                        {
                            "subject": "את",
                            "verb": "תוחשבי",
                            "nikud": "תָָּחְשְׁבִי, תֻּחְשְׁבִי, תָָּחָָשְׁבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יוחשב",
                            "nikud": "יָָחְשַׁב, יֻחְשַׁב, יָָחֳשַׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תוחשב",
                            "nikud": "תָָּחְשַׁב, תֻּחְשַׁב, תָָּחֳשַׁב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נוחשב",
                            "nikud": "נָָחְשַׁב, נֻחְשַׁב, נָָחֳשַׁב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תוחשבו",
                            "nikud": "תָָּחְשְׁבוּ, תֻּחְשְׁבוּ, תָָּחָָשְׁבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תוחשבנה",
                            "nikud": "תָָּחְשַׁבְנָה, תֻּחְשַׁבְנָה, תָָּחֳשַׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יוחשבו",
                            "nikud": "יָָחְשְׁבוּ, יֻחְשְׁבוּ, יָָחָָשְׁבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תוחשבנה",
                            "nikud": "תָָּחְשַׁבְנָה, תֻּחְשַׁבְנָה, תָָּחֳשַׁבְנָה"
                        }
                    ]
                }
            },
            {
                binyan: 'התפעל',
                binyanCode: '60',
                conjugation:
                {
                    "past": [
                        {
                            "subject": "אני",
                            "verb": "התחשבתי",
                            "nikud": "הִתְחַשַּׁבְתִּי"
                        },
                        {
                            "subject": "אתה",
                            "verb": "התחשבת",
                            "nikud": "הִתְחַשַּׁבְתָּ"
                        },
                        {
                            "subject": "את",
                            "verb": "התחשבת",
                            "nikud": "הִתְחַשַּׁבְתְּ"
                        },
                        {
                            "subject": "הוא",
                            "verb": "התחשב",
                            "nikud": "הִתְחַשֵּׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "התחשבה",
                            "nikud": "הִתְחַשְּׁבָה"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "התחשבנו",
                            "nikud": "הִתְחַשַּׁבְנוּ"
                        },
                        {
                            "subject": "אתם",
                            "verb": "התחשבתם",
                            "nikud": "הִתְחַשַּׁבְתֶּם"
                        },
                        {
                            "subject": "אתן",
                            "verb": "התחשבתן",
                            "nikud": "הִתְחַשַּׁבְתֶּן"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "התחשבו",
                            "nikud": "הִתְחַשְּׁבוּ"
                        }
                    ],
                    "present": [
                        {
                            "subject": "יחיד",
                            "verb": "מתחשב",
                            "nikud": "מִתְחַשֵּׁב"
                        },
                        {
                            "subject": "יחידה",
                            "verb": "מתחשבת",
                            "nikud": "מִתְחַשֶּׁבֶת"
                        },
                        {
                            "subject": "רבים",
                            "verb": "מתחשבים",
                            "nikud": "מִתְחַשְּׁבִים"
                        },
                        {
                            "subject": "רבות",
                            "verb": "מתחשבות",
                            "nikud": "מִתְחַשְּׁבוֹת"
                        }
                    ],
                    "future": [
                        {
                            "subject": "אני",
                            "verb": "אתחשב",
                            "nikud": "אֶתְחַשֵּׁב"
                        },
                        {
                            "subject": "אתה",
                            "verb": "תתחשב",
                            "nikud": "תִּתְחַשֵּׁב"
                        },
                        {
                            "subject": "את",
                            "verb": "תתחשבי",
                            "nikud": "תִּתְחַשְּׁבִי"
                        },
                        {
                            "subject": "הוא",
                            "verb": "יתחשב",
                            "nikud": "יִתְחַשֵּׁב"
                        },
                        {
                            "subject": "היא",
                            "verb": "תתחשב",
                            "nikud": "תִּתְחַשֵּׁב"
                        },
                        {
                            "subject": "אנחנו",
                            "verb": "נתחשב",
                            "nikud": "נִתְחַשֵּׁב"
                        },
                        {
                            "subject": "אתם/אתן",
                            "verb": "תתחשבו",
                            "nikud": "תִּתְחַשְּׁבוּ"
                        },
                        {
                            "subject": "אתן",
                            "verb": "תתחשבנה",
                            "nikud": "תִּתְחַשֵּׁבְנָה"
                        },
                        {
                            "subject": "הם/הן",
                            "verb": "יתחשבו",
                            "nikud": "יִתְחַשְּׁבוּ"
                        },
                        {
                            "subject": "הן",
                            "verb": "תתחשבנה",
                            "nikud": "תִּתְחַשֵּׁבְנָה"
                        }
                    ]
                }
            },
        ]
    },
];

export function getBinyanData(root, binyanCode, tense) {
    const rootData = binyanimExamples.find(b => b.root == root)?.binyanim;
    let data = rootData?.find(b => b.binyanCode == binyanCode);
    if (!data) {
        return null;
    }
    if (tense === 'past') {
        return data.conjugation.past;
    } else if (tense === 'present') {
        return data.conjugation.present;
    } else if (tense === 'future') {
        return data.conjugation.future;
    }
    return null;
}
/*
console.log(getBinyanData('כתב', 0, 'past'));
console.log(getBinyanData('כתב', 10, 'past'));
console.log(getBinyanData('כתב', 20, 'present'));
console.log(getBinyanData('כתב', 30, 'future'));
*/